# Pandas Introduction

In [1]:
import numpy as np
import pandas as pd

## Series object

In [2]:
series_obj = pd.Series([10,20,30,40,50])
series_obj

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
# index access
series_obj[0]

10

### Element-wise operations

In [4]:
series_ages = pd.Series([31,22,43,44,55])
series_ages

0    31
1    22
2    43
3    44
4    55
dtype: int64

In [5]:
series_ages + series_ages

0     62
1     44
2     86
3     88
4    110
dtype: int64

In [6]:
series_ages*2

0     62
1     44
2     86
3     88
4    110
dtype: int64

In [7]:
series_ages + 100

0    131
1    122
2    143
3    144
4    155
dtype: int64

### Boolean selection

In [8]:
series_ages>40

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [9]:
#boolean access
series_ages[series_ages>40]

2    43
3    44
4    55
dtype: int64

## DataFrame object

In [10]:
# create a DataFrame using dictionary (of Series objects)
data = {"Name": ["Tim Miller", "Ann Carter", "Ellen Lee", "Sam Carr", "Al Ball", "Carl Zee", "Sara Martin"], 
        "Gender": ["Male", "Female", "Female", "Male", "Male", "Male", "Female"],
        "Age": [32, 44, 21, 19, 45, 27, 39]}
df = pd.DataFrame(data)
# print(df)  #when using print(), the DataFrame does not display as an HTML table
df

          Name  Gender  Age
0   Tim Miller    Male   32
1   Ann Carter  Female   44
2    Ellen Lee  Female   21
3     Sam Carr    Male   19
4      Al Ball    Male   45
5     Carl Zee    Male   27
6  Sara Martin  Female   39

In [12]:
# show first 5 rows
df.head() # == df.head(5)

         Name  Gender  Age
0  Tim Miller    Male   32
1  Ann Carter  Female   44
2   Ellen Lee  Female   21

In [13]:
# show last 5 rows
df.tail()  # == df.tail(5)

          Name  Gender  Age
2    Ellen Lee  Female   21
3     Sam Carr    Male   19
4      Al Ball    Male   45
5     Carl Zee    Male   27
6  Sara Martin  Female   39

In [14]:
# returns a column/Series object
df['Name']     # dictionary notation

0     Tim Miller
1     Ann Carter
2      Ellen Lee
3       Sam Carr
4        Al Ball
5       Carl Zee
6    Sara Martin
Name: Name, dtype: object

In [15]:
df.Name     # attribute notation; Tab completion

0     Tim Miller
1     Ann Carter
2      Ellen Lee
3       Sam Carr
4        Al Ball
5       Carl Zee
6    Sara Martin
Name: Name, dtype: object

In [16]:
# assignment by column (or add a column)
df["Birth Year"] = 1999
df

          Name  Gender  Age  Birth Year
0   Tim Miller    Male   32        1999
1   Ann Carter  Female   44        1999
2    Ellen Lee  Female   21        1999
3     Sam Carr    Male   19        1999
4      Al Ball    Male   45        1999
5     Carl Zee    Male   27        1999
6  Sara Martin  Female   39        1999

In [17]:
# assignment by column (or add a column)
df["Married"] = ['Yes', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No']     # must match the length of the DataFrame
df

          Name  Gender  Age  Birth Year Married
0   Tim Miller    Male   32        1999     Yes
1   Ann Carter  Female   44        1999     Yes
2    Ellen Lee  Female   21        1999      No
3     Sam Carr    Male   19        1999      No
4      Al Ball    Male   45        1999     Yes
5     Carl Zee    Male   27        1999     Yes
6  Sara Martin  Female   39        1999      No

## Selection and Filtering
### Column selection

In [18]:
# create a new DataFrame
data = pd.DataFrame(np.arange(100).reshape(10,10), columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
data

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [20]:
data['a']

0     0
1    10
2    20
3    30
4    40
5    50
6    60
7    70
8    80
9    90
Name: a, dtype: int32

In [21]:
data[["a", "e", "j"]]    # providing a list selects multiple columns

    a   e   j
0   0   4   9
1  10  14  19
2  20  24  29
3  30  34  39
4  40  44  49
5  50  54  59
6  60  64  69
7  70  74  79
8  80  84  89
9  90  94  99

In [ ]:
data[["j", "e", "a"]]

### Row selection

In [22]:
data[:1]     # use slice syntax to select rows

   a  b  c  d  e  f  g  h  i  j
0  0  1  2  3  4  5  6  7  8  9

In [23]:
data[5:9]

    a   b   c   d   e   f   g   h   i   j
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89

In [24]:
#boolean
mask = data["j"] > 40

In [25]:
# boolean selection
data[mask]

    a   b   c   d   e   f   g   h   i   j
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

### Row and Column selection with loc
Allows you to select a subset of the rows and columns using the label/name of the row/column

In [26]:
data

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49
5  50  51  52  53  54  55  56  57  58  59
6  60  61  62  63  64  65  66  67  68  69
7  70  71  72  73  74  75  76  77  78  79
8  80  81  82  83  84  85  86  87  88  89
9  90  91  92  93  94  95  96  97  98  99

In [27]:
# loc implies the name/label of the row and column
data.loc[:5, "b"]

0     1
1    11
2    21
3    31
4    41
5    51
Name: b, dtype: int32

In [28]:

data.loc[6:, 'a':'e']     # consecutive (loc selection is inclusive)

    a   b   c   d   e
6  60  61  62  63  64
7  70  71  72  73  74
8  80  81  82  83  84
9  90  91  92  93  94

In [29]:
data.loc[:, ['c', 'f', 'i']]     # not consecutive

    c   f   i
0   2   5   8
1  12  15  18
2  22  25  28
3  32  35  38
4  42  45  48
5  52  55  58
6  62  65  68
7  72  75  78
8  82  85  88
9  92  95  98

### Row and Column selection with iloc
Allows you to select a subset of the rows and columns using the integer/index position of the row/column

In [30]:
# iloc is for integer/index selection  (iloc selection is exclusive)
data.iloc[:5, 2:5]

    c   d   e
0   2   3   4
1  12  13  14
2  22  23  24
3  32  33  34
4  42  43  44

In [31]:
data.iloc[:5]  # gives you a row, assumes all of the columns

    a   b   c   d   e   f   g   h   i   j
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

In [32]:
data.iloc[[5, 0, 3], [9, 5, 0]]  # returns selections in the order listed

    j   f   a
5  59  55  50
0   9   5   0
3  39  35  30

# Data Exploration

### Descriptive and summary statistics

In [33]:
ucla_admit_df = pd.read_csv("ucla_admit.csv")

In [34]:
ucla_admit_df.head(15)

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,GPA,Research,Admitted
0,1,337,118,4,4.5,4.5,3.89,1,Yes
1,2,324,107,4,4.0,4.5,3.58,1,Yes
2,3,316,104,3,3.0,3.5,3.23,1,No
3,4,322,110,3,3.5,2.5,3.50,1,Yes
4,5,314,103,2,2.0,3.0,3.31,0,No
5,6,330,115,5,4.5,3.0,3.77,1,Yes
6,7,321,109,3,3.0,4.0,3.31,1,Yes
7,8,308,101,2,3.0,4.0,3.19,0,No
8,9,302,102,1,2.0,1.5,3.23,0,No
9,10,323,108,3,3.5,3.0,3.47,0,No
10,11,325,106,3,3.5,4.0,3.39,1,No
11,12,327,111,4,4.0,4.5,3.63,1,Yes
12,13,328,112,4,4.0,4.5,3.67,1,Yes
13,14,307,109,3,4.0,3.0,3.23,1,No
14,15,311,104,3,3.5,2.0,3.31,1,No

In [35]:
ucla_admit_df.shape

(400, 9)

In [ ]:
# drop features

# drop returns a copy
ucla_admit_df = ucla_admit_df.drop("Serial No.", axis=1, inplacer=True)

ucla_admit_df.head()

In [41]:
ucla_admit_df.drop?

In [42]:
ucla_admit_df.describe()

,Serial No.,GRE Score,TOEFL Score,University Rating,SOP,LOR,GPA,Research
count,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000,400.000000
mean,200.500000,316.807500,107.410000,3.087500,3.400000,3.452500,3.467325,0.547500
std,115.614301,11.473646,6.069514,1.143728,1.006869,0.898478,0.240524,0.498362
min,1.000000,290.000000,92.000000,1.000000,1.000000,1.000000,2.740000,0.000000
25%,100.750000,308.000000,103.000000,2.000000,2.500000,3.000000,3.290000,0.000000
50%,200.500000,317.000000,107.000000,3.000000,3.500000,3.500000,3.475000,1.000000
75%,300.250000,325.000000,112.000000,4.000000,4.000000,4.000000,3.652500,1.000000
max,400.000000,340.000000,120.000000,5.000000,5.000000,5.000000,4.000000,1.000000

In [49]:
ucla_admit_df.describe(include='O')

       Admitted
count       400
unique        2
top          No
freq        209

In [43]:
# useful methods for describing the data

ucla_admit_df["GRE Score"].max()

# ucla_admit_df["GPA"].min()
# ucla_admit_df["GPA"].mean()
# ucla_admit_df["Admitted"].sum()

340

In [44]:
ucla_admit_df["GRE Score"].unique()

array([337, 324, 316, 322, 314, 330, 321, 308, 302, 323, 325, 327, 328,
       307, 311, 317, 319, 318, 303, 312, 334, 336, 340, 298, 295, 310,
       300, 338, 331, 320, 299, 304, 313, 332, 326, 329, 339, 309, 315,
       301, 296, 294, 306, 305, 290, 335, 333, 297, 293], dtype=int64)

In [45]:
set(ucla_admit_df["GRE Score"])

{290,
 293,
 294,
 295,
 296,
 297,
 298,
 299,
 300,
 301,
 302,
 303,
 304,
 305,
 306,
 307,
 308,
 309,
 310,
 311,
 312,
 313,
 314,
 315,
 316,
 317,
 318,
 319,
 320,
 321,
 322,
 323,
 324,
 325,
 326,
 327,
 328,
 329,
 330,
 331,
 332,
 333,
 334,
 335,
 336,
 337,
 338,
 339,
 340}

### Boolean Selection

In [46]:
ucla_admit_df["Admitted"]=="Yes"

0       True
1       True
2      False
3       True
4      False
5       True
6       True
7      False
8      False
9      False
10     False
11      True
12      True
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21     False
22      True
23      True
24      True
25      True
26      True
27     False
28     False
29     False
       ...
370    False
371     True
372     True
373     True
374    False
375    False
376    False
377    False
378    False
379    False
380     True
381    False
382     True
383    False
384     True
385     True
386    False
387    False
388    False
389     True
390    False
391    False
392     True
393     True
394     True
395     True
396     True
397     True
398    False
399     True
Name: Admitted, Length: 400, dtype: bool

In [52]:
# use count() to get the quantity of items in a Series/column
ucla_admit_df.loc[ucla_admit_df["GRE Score"] < 308, "GRE Score"].count()

90

In [55]:
# And (&)
# GRE less than the 25th percentile
ucla_admit_df.loc[(ucla_admit_df["GRE Score"] < 308) & (ucla_admit_df["Admitted"]=="Yes"), "GRE Score"].count()

GRE Score    3
GPA          3
dtype: int64

In [56]:
# GRE above the 75th percentile and GPA below the 50th percentile
ucla_admit_df.loc[(ucla_admit_df["GRE Score"] >325) & (ucla_admit_df["GPA"]<3.47), "GRE Score"].count()

4

In [57]:
# use value_counts() to break out the total count by category
ucla_admit_df.loc[(ucla_admit_df["GRE Score"] >325) & (ucla_admit_df["GPA"]<3.47), "Admitted"].value_counts()

Yes    3
No     1
Name: Admitted, dtype: int64

In [59]:
ucla_admit_df.loc[ucla_admit_df["Admitted"] == "Yes", ["GRE Score", "GPA"]].min()

GRE Score    303.00
GPA            3.23
dtype: float64

In [62]:
# Or (|)
ucla_admit_df.loc[(ucla_admit_df["GRE Score"] == 340) & (ucla_admit_df["GPA"]==4.0),"Admitted"].value_counts()

Yes    2
Name: Admitted, dtype: int64

In [61]:

ucla_admit_df.loc[(ucla_admit_df["SOP"] == 5) | (ucla_admit_df["LOR "]==5),"Admitted"].value_counts()

Yes    51
No      3
Name: Admitted, dtype: int64

## Archive cleaned and transformed DataFrame

In [ ]:
# to save your cleaned data to file
df.to_csv("new_filename.csv")